app/views/songs/_form.html.erb

  <br />
  <%= artist_select("artist:", Artist.all) %>
---
SELECT "artists".* FROM "artists"